AV/FO/INTERSPEC_interfaces_SAP/ExpSapHU/Exp2Sap-example-UpdateCreateProcessingGroups-2-xml.txt

<soap:Envelope xmlns:xsl="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateOrCreateProcessingGroups xmlns="http://apollovredestein.com/interspec_sap">
      <SequenceNr>243060</SequenceNr>
      <Plant>5M01</Plant>
      <Article>E1CH195520QPPX-G</Article>
      <TemplateArticle>TEMPLATE_EG_PCR</TemplateArticle>
      <ProcessingGroups>
        <ProcessingGroup>
          <LineNr>10</LineNr>
          <GroupName>APBMI</GroupName>
          <ProdVersion>10</ProdVersion>
          <WorkInstrRef>10</WorkInstrRef>
          <BomVersion>1</BomVersion>
          <ControlKey>ZP04</ControlKey>
          <ProcessNorm>0</ProcessNorm>
          <CarrierCode/>
          <PackageQuantity/>
          <Machine_Recipe_Code/>
        </ProcessingGroup>
        <ProcessingGroup>
          <LineNr>20</LineNr>
          <GroupName>APBMJ</GroupName>
          <ProdVersion>20</ProdVersion>
          <WorkInstrRef>20</WorkInstrRef>
          <BomVersion>1</BomVersion>
          <ControlKey>ZP04</ControlKey>
          <ProcessNorm>0</ProcessNorm>
          <CarrierCode/>
          <PackageQuantity/>
          <Machine_Recipe_Code/>
        </ProcessingGroup>
      </ProcessingGroups>
    </UpdateOrCreateProcessingGroups>
  </soap:Body>
</soap:Envelope>